In [2]:
import pandas as pd
import numpy as np

import matplotlib
import matplotlib.pyplot as plt

# Нажмите Tab для автопредположений
planets = pd.read_csv('планеты.xls')
planets

,Planet,Mass,Diameter,DayLength,SunDistance,OrbitPeriod,OrbitVelocity,MeanTemperature,SurfacePressure,Moons,Rings,MagneticField,FirstVisited,FirstMission
0,MERCURY,0.3300,4879,4222.6,57.9,88,47.4,167,0.00000,0,No,Yes,1974-03-29,Mariner 10
1,VENUS,4.8700,"12,104",2802.0,108.2,224.7,35.0,464,92.00000,0,No,No,1962-08-27,Mariner 2
2,EARTH,5.9700,"12,756",24.0,149.6,365.2,29.8,15,1.00000,1,No,Yes,NaN,NaN
3,MOON,0.0730,3475,708.7,NaN,27.3,1.0,-20,0.00000,0,No,No,1959-09-12,Luna 2
4,MARS,0.6420,6792,24.7,227.9,687,24.1,-65,0.01000,2,No,No,1965-07-15,Mariner 4
5,JUPITER,1898.0000,"142,984",9.9,778.6,4331,13.1,-110,NaN,67,Yes,Yes,1973-12-04,Pioneer 10
6,SATURN,568.0000,"120,536",10.7,1433.5,"10,747",9.7,-140,NaN,62,Yes,Yes,1979-09-01,Pioneer 11
7,URANUS,86.8000,"51,118",17.2,2872.5,"30,589",6.8,-195,NaN,27,Yes,Yes,1986-01-24,Voyager 2
8,NEPTUNE,102.0000,"49,528",16.1,4495.1,"59,800",5.4,-200,NaN,14,Yes,Yes,1989-08-25,Voyager 2
9,PLUTO,0.0146,2370,153.3,5906.4,"90,560",4.7,-225,0.00001,5,No,NaN,2015-07-14,New Horizons

In [3]:
planets = pd.read_csv('планеты.xls', usecols = [0, 1, 2, 3])
planets

    Planet       Mass Diameter  DayLength
0  MERCURY     0.3300     4879     4222.6
1    VENUS     4.8700   12,104     2802.0
2    EARTH     5.9700   12,756       24.0
3     MOON     0.0730     3475      708.7
4     MARS     0.6420     6792       24.7
5  JUPITER  1898.0000  142,984        9.9
6   SATURN   568.0000  120,536       10.7
7   URANUS    86.8000   51,118       17.2
8  NEPTUNE   102.0000   49,528       16.1
9    PLUTO     0.0146     2370      153.3

In [4]:
planets['Mass']

0       0.3300
1       4.8700
2       5.9700
3       0.0730
4       0.6420
5    1898.0000
6     568.0000
7      86.8000
8     102.0000
9       0.0146
Name: Mass, dtype: float64

In [5]:
# Точечное обращение тоже допустимо
planets.Mass

0       0.3300
1       4.8700
2       5.9700
3       0.0730
4       0.6420
5    1898.0000
6     568.0000
7      86.8000
8     102.0000
9       0.0146
Name: Mass, dtype: float64

In [6]:
planets.index

RangeIndex(start=0, stop=10, step=1)

In [7]:
# Выбрать определенную строку
planets.loc[0]

Planet       MERCURY
Mass            0.33
Diameter        4879
DayLength     4222.6
Name: 0, dtype: object

In [8]:
planets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Planet     10 non-null     object
 1   Mass       10 non-null     float64
 2   Diameter   10 non-null     object
 3   DayLength  10 non-null     float64
dtypes: float64(2), object(2)
memory usage: 448.0+ bytes

In [9]:
len(planets)

10

In [19]:
planets.loc[1]

Planet        VENUS
Mass           4.87
Diameter     12,104
DayLength      2802
Name: 1, dtype: object

In [20]:
# Ряд
planets.loc[1: 3]

  Planet   Mass Diameter  DayLength
1  VENUS  4.870   12,104     2802.0
2  EARTH  5.970   12,756       24.0
3   MOON  0.073     3475      708.7

In [23]:
planets.columns

Index(['Mass', 'Diameter', 'DayLength'], dtype='object')

In [21]:
planets = pd.read_csv('планеты.xls')
planets.FirstVisited[1]

'1962-08-27'

In [22]:
planets.loc[1].FirstVisited

'1962-08-27'

In [25]:
planets.loc[1: 3].FirstVisited

1    1962-08-27
2           NaN
3    1959-09-12
Name: FirstVisited, dtype: object

In [26]:
# Отобризим тип запрашиваемых данных
type(planets.loc[1: 3].FirstVisited)

pandas.core.series.Series

In [28]:
# Отобразим даты посещений
pd.to_datetime(planets.FirstVisited)

0   1974-03-29
1   1962-08-27
2          NaT
3   1959-09-12
4   1965-07-15
5   1973-12-04
6   1979-09-01
7   1986-01-24
8   1989-08-25
9   2015-07-14
Name: FirstVisited, dtype: datetime64[ns]

In [29]:
# Отобразим только год
planets.FirstVisited = pd.to_datetime(planets.FirstVisited)
planets.FirstVisited.dt.year

0    1974.0
1    1962.0
2       NaN
3    1959.0
4    1965.0
5    1973.0
6    1979.0
7    1986.0
8    1989.0
9    2015.0
Name: FirstVisited, dtype: float64